<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of PVP3 and imports into Munki.

</string>
	<key>Identifier</key>
	<string>com.github.eric-olson.munki.PVP3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PVP3</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/PVP3</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://www.renewedvision.com/update/PVP3.php</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>
            ProVideoPlayer (PVP) is a Mac-based software application designed to play back and manipulate video across one or more screens.</string>
			<key>display_name</key>
			<string>PVP3</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eric-olson.download.PVP3</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
