<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of ProPresenter and imports into Munki.

</string>
	<key>Identifier</key>
	<string>com.github.eric-olson.munki.ProPresenter5</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ProPresenter5</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/ProPresenter5</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://www.renewedvision.com/update/ProPresenter5.php</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>ProPresenter is a cross-platform (Mac and Windows) lyric and media presentation package built specifically to make high-quality live productions easy.</string>
			<key>display_name</key>
			<string>ProPresenter 5</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.eric-olson.download.ProPresenter5</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
